BusinessProcesses/СогласованиеРеестровБезКурирующего.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<BusinessProcess>
		<Properties>
			<Name>СогласованиеРеестровБезКурирующего</Name>
			<Task>Task.ЗадачаИсполнителяПоСогласованиюПлатежей</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодписанПредседателем</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаДиректоромФДВыполнена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаДиректоромКДВыполнена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаРасходованиеСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ден_ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦС_СостоянияСогласованияПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеестрСогласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурирующийЧП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиректорФД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаПередачаНаОплату</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КомментарииПроцесса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрикрепленныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Платежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поручение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представительство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Представительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаФинансирование</Name>
							<Type>
								<v8:Type>cfg:BusinessProcessRef.СогласованиеПлатежей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийСогласующего</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаФилиалы</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.б_ЗаявкаНаФинансирование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаФинансированиеПредставительств</Name>
							<Type>
								<v8:Type>cfg:BusinessProcessRef.СогласованиеПлатежейПредставительств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаСХТП</Name>
							<Type>
								<v8:Type>cfg:BusinessProcessRef.СогласованиеПлатежейПоФорвардномуЗакупуСХТП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаПоФорвардномуЗакупу</Name>
							<Type>
								<v8:Type>cfg:BusinessProcessRef.СогласованиеПлатежейПоФорвардномуЗакупу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаПоЗакупу</Name>
							<Type>
								<v8:Type>cfg:BusinessProcessRef.СогласованиеПлатежейПоЗакупу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКонтрагента</Name>
							<Comment>(Общ) Банковский счет контрагента</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭСФ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭСФ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

InformationRegisters/Бит_АдресацияУведомленийПоКомандировкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Бит_АдресацияУведомленийПоКомандировкам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адресат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦС_ЭтапыМаршрутовБП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЦС_СостоянияСогласованияПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЦС_СостоянияСогласованияПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказанРуководителемДепартамента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказанФинансовымДепартаментом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказанИсполнителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказанРуководителемФД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказанВР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УспешноЗавершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BusinessProcesses/СогласованиеРеестровБезКурирующего/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	Автор = ПараметрыСеанса.ТекущийПользователь;
	Состояние = Перечисления.ЦС_СостоянияСогласованияПлатежей.ВРаботе;	
	Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновнаяОрганизация");
КонецПроцедуры

Функция ПолучитьАдресатаДляТекущегоЭтапа(Постановщик,ТочкаЭтапа);
	
	//Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСВР Тогда
	//	Возврат КурирующийЧП;
	//КонецЕсли;
	
	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемФД Тогда
		Возврат ДиректорФД;
	КонецЕсли;


		Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Бит_АдресацияУведомленийПоКомандировкам.Адресат,
	|	Бит_АдресацияУведомленийПоКомандировкам.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.Бит_АдресацияУведомленийПоКомандировкам КАК Бит_АдресацияУведомленийПоКомандировкам
	|ГДЕ
	|	(Бит_АдресацияУведомленийПоКомандировкам.Пользователь = &Пользователь
	|			ИЛИ Бит_АдресацияУведомленийПоКомандировкам.Пользователь = &ПустойПользователь)
	|	И Бит_АдресацияУведомленийПоКомандировкам.ЭтапМаршрута = &ЭтапМаршрута
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователь УБЫВ";
	
	Запрос.УстановитьПараметр("Пользователь", Постановщик);
	Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());

	Запрос.УстановитьПараметр("ЭтапМаршрута", ТочкаЭтапа);
	
	Результат = Запрос.Выполнить();
	Выборка = результат.Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Адресат;
	КонецЕсли;
КонецФункции

Процедура ОбработатьЭтап(Постановщик, ТочкаЭтапа,ФормируемыеЗадачи,Отказ, ЯвныйАдресат = Неопределено)
	
	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.ОтправленНаДоработкуАвтором тогда 
		Адресат = Постановщик;
	Иначе    
		Если ЯвныйАдресат = Неопределено тогда
			Адресат = ПолучитьАдресатаДляТекущегоЭтапа(Постановщик,ТочкаЭтапа);
		Иначе
			Адресат = ЯвныйАдресат;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если Адресат = Неопределено или Адресат.Пустая() тогда 
		Отказ = Истина;
		Сообщить("Для текущего пользователя на этапе "+ТочкаЭтапа+" не найден адресат");
		Возврат;
	КонецЕсли;
	
	Для Каждого Задача из ФормируемыеЗадачи Цикл
		
//		Задача.ЗаявкаНаРасходованиеСредств = ЗаявкаНаРасходованиеСредств;
		Если ТипЗнч(Адресат) = Тип("СправочникСсылка.Пользователи") тогда
			Задача.Пользователь = Адресат;
		Иначе
			Задача.Подразделение = Адресат;
		КонецЕсли;
		ЦС_ОбщегоНазначенияСервер.ОтправитьПисьмоПоИзменениюЗаявок(Задача.бизнеспроцесс, Адресат, Задача);
	КонецЦикла;
				
КонецПроцедуры

Процедура ОбработатьВыборВарианта(ТочкаВыбораВарианта, Результат,МаркерЭтапа)
	
	Если МаркерЭтапа = "Разрешено" тогда
		Результат = ТочкаВыбораВарианта.Варианты.Разрешено;
	ИначеЕсли МаркерЭтапа = "Возвращено" тогда
		Результат = ТочкаВыбораВарианта.Варианты.Возвращено;
	ИначеЕсли МаркерЭтапа = "Отказано" тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказано;
	КонецЕсли;
	
КонецПроцедуры

Процедура РаботаСЗаявкойАвторомПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ОбработатьЭтап(Автор,Справочники.ЦС_ЭтапыМаршрутовБП.ОтправленНаДоработкуАвтором,ФормируемыеЗадачи,Отказ);
КонецПроцедуры                   


Процедура СогласованиеСДиректоромФДПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ОбработатьЭтап(Автор,Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемФД,ФормируемыеЗадачи,Отказ);

КонецПроцедуры

Процедура РезультатПроверкиДиректоромФДОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ОбработатьВыборВарианта(ТочкаВыбораВарианта, Результат, ПроверкаДиректоромФДВыполнена);	
	
	Если Результат = ТочкаВыбораВарианта.Варианты.Отказано Тогда  
		Завершен = Истина;
		Состояние = Перечисления.ЦС_СостоянияСогласованияПлатежей.ОтказанРуководителемФД;
	КонецЕсли;

КонецПроцедуры

Процедура ПроверкаВРПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ОбработатьЭтап(Автор,Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСВР,ФормируемыеЗадачи,Отказ);

КонецПроцедуры

Процедура РезультатПроверкиВРОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	ОбработатьВыборВарианта(ТочкаВыбораВарианта, Результат, ПодписанПредседателем);	
	
	Если Результат = ТочкаВыбораВарианта.Варианты.Отказано Тогда  
		Завершен = Истина;
		Состояние = Перечисления.ЦС_СостоянияСогласованияПлатежей.ОтказанВР;
	КонецЕсли;

	Если ПроверкаДиректоромКДВыполнена = "Разрешено" Тогда
		
		ЭтотОбъект.РеестрСогласован = Истина;
		ЭтотОбъект.Записать();
	КонецЕсли;
	

КонецПроцедуры

Процедура СозданиеПППриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ОбработатьЭтап(Автор,Справочники.ЦС_ЭтапыМаршрутовБП.СозданиеПП,ФормируемыеЗадачи,Отказ);

КонецПроцедуры

Процедура ИзменитьВключениеВРеестр(ПараметрЗаявка);
	//+++ Oleg SmartT. 2021-03-29
	Если ЗначениеЗаполнено(ПараметрЗаявка) Тогда
		ДокументОбъект = ПараметрЗаявка.ПолучитьОбъект();
		
		Если ДокументОбъект.ЗаявкаВключенаВРеестр = Ложь Тогда
			ДокументОбъект.ЗаявкаВключенаВРеестр = Истина;
			ДокументОбъект.Записать();
		КонецЕсли;
		
	КонецЕсли;
	//--- Oleg SmartT. 2021-03-29
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Платежи.Количество() > 0 И ЭтотОбъект.РеестрСогласован = Истина Тогда
		
		Для Каждого Строка из Платежи Цикл
			
			//+++ Oleg SmartT. 2021-03-29
			ИзменитьВключениеВРеестр(Строка.ЗаявкаНаФинансирование);
			ИзменитьВключениеВРеестр(Строка.ЗаявкаНаФинансированиеПредставительств);
			ИзменитьВключениеВРеестр(Строка.ЗаявкаСХТП);
			ИзменитьВключениеВРеестр(Строка.ЗаявкаПоЗакупу);
			//--- Oleg SmartT. 2021-03-29	
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СогласованиеСДиректоромКДПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ОбработатьЭтап(Автор,Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемКД,ФормируемыеЗадачи,Отказ);

КонецПроцедуры

Процедура РезультатПроверкиДиректоромКДОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ОбработатьВыборВарианта(ТочкаВыбораВарианта, Результат, ПроверкаДиректоромКДВыполнена);	
	
	Если Результат = ТочкаВыбораВарианта.Варианты.Отказано Тогда  
		Завершен = Истина;
		Состояние = Перечисления.ЦС_СостоянияСогласованияПлатежей.ОтказанРуководителемДепартамента;
	КонецЕсли;

	Если Результат = ТочкаВыбораВарианта.Варианты.Разрешено Тогда
		
		ЭтотОбъект.РеестрСогласован = Истина;
		ЭтотОбъект.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура СогласованиеСФДПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Если ЗначениеЗаполнено(ДиректорФД) Тогда
		Результат = Истина
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура РезультатДБУСогласованиеПередПеречислениемДенегОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	ОбработатьВыборВарианта(ТочкаВыбораВарианта, Результат, ПроверкаПередачаНаОплату);	
	
	Если Результат = ТочкаВыбораВарианта.Варианты.Отказано Тогда  
		Завершен = Истина;
		Состояние = Перечисления.ЦС_СостоянияСогласованияПлатежей.Отказано;
	КонецЕсли;

	Если Результат = ТочкаВыбораВарианта.Варианты.Разрешено Тогда
		
		ЭтотОбъект.РеестрСогласован = Истина;
		ЭтотОбъект.Записать();
	КонецЕсли;
КонецПроцедуры
